#+title: Exercise 25
** Result

#+begin_src bash :exports results :results output
racket ./src/exercise-25.rkt
#+end_src

#+RESULTS:
: ok
: pass: testing original table insertion and lookup
: ok
: pass: exact value lookup for number table
: pass: equivalent lookup for number table
: ok
: pass: arbitrary key insertion and lookup testing

This is working as we expect, as now, we have a third level nesting for a table insertion and lookup, which through our edge to edge testing, has passed.
